#include <stdio.h>
int main()
{
	/* Ãµ°£(ô¸ÊÎ), ÁöÁö(ò¢ò¨) */ 
	char *cheongan[10] = { "ÌÒ", "ãô", "ìó", "Í¤", "Ë£", "ëà", "Ü°", "ïË", "Ùæ", "Ğù"};
	char *jiji[12] = {"ãé", "ë·", "âù", "ú¤", "í­", "õä", "ìÙ", "ÙÖ", "òã", "ŞÓ", "çí", "Ú±"};
	char *cheongan_hangul[10] = { "°æ", "½Å", "ÀÓ", "°è", "°©", "À»", "º´", "Á¤", "¹«", "±â"};
	char *jiji_hangul[12] = {"½Å", "À¯", "¼ú", "ÇØ", "ÀÚ", "Ãà", "ÀÎ",
				 "¹¦", "Áø", "»ç", "¿À", "¹Ì"};
	char *tti[12] = {"¿ø¼şÀÌ", "´ß", "°³", "µÅÁö", "Áã", "¼Ò", "È£¶ûÀÌ",
				 "Åä³¢", "¿ë", "¹ì", "¸»", "¾ç"};
	int year, cheongan_mod, jiji_mod, y;

	printf("³âµµ¸¦ ÀÔ·ÂÇÏ½Ã¿À : ");
	scanf("%d", &year); 
	cheongan_mod = year % 10;
	jiji_mod = year % 12;
	printf("%d³â ", year);
	printf("%s%sÒ´(%s%s³â) : %s¶ì\n\n\n", *(cheongan+cheongan_mod),
		*(jiji+jiji_mod), *(cheongan_hangul+cheongan_mod),
		*(jiji_hangul+jiji_mod), *(tti+jiji_mod));
	for(y = year - 5; y<=year+5; y++)
	{
		cheongan_mod = y % 10;
		jiji_mod = y % 12;
		printf("%d³â ", y);
		printf("%s%sÒ´(%s%s³â) : %s¶ì\n", *(cheongan+cheongan_mod),
			*(jiji+jiji_mod), *(cheongan_hangul+cheongan_mod),
			*(jiji_hangul+jiji_mod), *(tti+jiji_mod));
	}
}
/* 
 0 Ë£í­  1 ëàõä  2 Ü°ìÙ  3 ïËÙÖ  4 Ùæòã  5 ĞùŞÓ  6 ÌÒçí  7 ãôÚ±  8 ìóãé  9 Í¤ë· 
10 Ë£âù 11 ëàú¤ 12 Ü°í­ 13 ïËõä 14 ÙæìÙ 15 ĞùÙÖ 16 ÌÒòã 17 ãôŞÓ 18 ìóçí 19 Í¤Ú± 
20 Ë£ãé 21 ëàë· 22 Ü°âù 23 ïËú¤ 24 Ùæí­ 25 Ğùõä 26 ÌÒìÙ 27 ãôÙÖ 28 ìóòã 29 Í¤ŞÓ 
30 Ë£çí 31 ëàÚ± 32 Ü°ãé 33 ïËë· 34 Ùæâù 35 Ğùú¤ 36 ÌÒí­ 37 ãôõä 38 ìóìÙ 39 Í¤ÙÖ 
40 Ë£òã 41 ëàŞÓ 42 Ü°çí 43 ïËÚ± 44 Ùæãé 45 Ğùë· 46 ÌÒâù 47 ãôú¤ 48 ìóí­ 49 Í¤õä 
50 Ë£ìÙ 51 ëàÙÖ 52 Ü°òã 53 ïËŞÓ 54 Ùæçí 55 ĞùÚ± 56 ÌÒãé 57 ãôë· 58 ìóâù 59 Í¤ú¤ 
*/ 
